This is METAFONT, Version 2.7182818 (TeX Live 2016) (preloaded base=mf 2016.5.22)  30 OCT 2022 11:21
**Figure-Titration-curves Figure-Titration-curves-old
(Figure-Titration-curves
>> stepcounter
! Isolated expression.
<to be read again> 
                   {
l.3  \stepcounter{
                  figurenewcounter}   \refstepcounter{figure}  \label{Fig:{\...

? 
! Extra tokens will be flushed.
<to be read again> 
                   {
l.3  \stepcounter{
                  figurenewcounter}   \refstepcounter{figure}  \label{Fig:{\...

? 
! Interruption.
l.3  \stepcounter{
                  figurenewcounter}   \refstepcounter{figure}  \label{Fig:{\...

? 
! An expression can't begin with `['.
<inserted text> 
                0
<to be read again> 
                   [
l.11  \draw [
             ->, black, shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
! A primary expression can't begin with `>'.
<inserted text> 
                0
<to be read again> 
                   >
l.11  \draw [->
               , black, shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
! A tertiary expression can't begin with `,'.
<inserted text> 
                0
<to be read again> 
                   ,
l.11  \draw [->,
                 black, shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
! Missing `]' has been inserted.
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
>> black
>> false
! Not implemented: (unknown numeric)-(boolean).
<to be read again> 
                   ,
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
>> 0
>> false
! Not implemented: (known numeric)*(boolean).
<to be read again> 
                   ,
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
>> false
>> false
! Not implemented: (boolean)+(boolean).
<to be read again> 
                   ,
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
! Interruption.
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
>> false
>> (0,0,1,0,0,1)
! Not implemented: (boolean)transformed(transform).
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
>> (0,0,1,0,0,1)
! Improper `addto'.
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
! Extra tokens will be flushed.
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.11  \draw [->, black,
                        shift={(0,0)}]  (0,0) -- (0,5) node [rotate=90, shif...

? 
! An expression can't begin with `['.
<inserted text> 
                0
<to be read again> 
                   [
l.12 \draw [
            cyan, thick, shift={(-8em,2em)}] plot [smooth, tension=0.25] coo...

? 
! Missing `]' has been inserted.
<to be read again> 
                   ,
l.12 \draw [cyan, thick,
                         shift={(-8em,2em)}] plot [smooth, tension=0.25] coo...

? 
>> cyan
>> (0,0,1,0,0,1)
! Not implemented: (unknown numeric)transformed(transform).
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.12 \draw [cyan, thick,
                         shift={(-8em,2em)}] plot [smooth, tension=0.25] coo...

? 
>> (0,0,1,0,0,1)
! Improper `addto'.
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.12 \draw [cyan, thick,
                         shift={(-8em,2em)}] plot [smooth, tension=0.25] coo...

? 
! Extra tokens will be flushed.
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.12 \draw [cyan, thick,
                         shift={(-8em,2em)}] plot [smooth, tension=0.25] coo...

? 
! An expression can't begin with `['.
<inserted text> 
                0
<to be read again> 
                   [
l.13 \draw [
            black,dashed, shift={(0,0)}] node[shift={(-.5em,6.5em)}] {7} (-0...

? 
! Missing `]' has been inserted.
<to be read again> 
                   ,
l.13 \draw [black,dashed,
                          shift={(0,0)}] node[shift={(-.5em,6.5em)}] {7} (-0...

? 
>> black
>> (0,0,1,0,0,1)
! Not implemented: (unknown numeric)transformed(transform).
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.13 \draw [black,dashed,
                          shift={(0,0)}] node[shift={(-.5em,6.5em)}] {7} (-0...

? 
>> (0,0,1,0,0,1)
! Improper `addto'.
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.13 \draw [black,dashed,
                          shift={(0,0)}] node[shift={(-.5em,6.5em)}] {7} (-0...

? 
! Extra tokens will be flushed.
<to be read again> 
                   withpen
draw->...urrentpicture.doublepath(EXPR0)t_.withpen
                                                  .currentpen
<to be read again> 
                   ,
l.13 \draw [black,dashed,
                          shift={(0,0)}] node[shift={(-.5em,6.5em)}] {7} (-0...

? 
! A tertiary expression can't begin with `{'.
<inserted text> 
                0
<to be read again> 
                   {
l.14 \node[shift={
                  (5em,13em)}] {HCl Titration};
? 
>> shift
! Unknown relation will be considered false.
<to be read again> 
                   {
l.14 \node[shift={
                  (5em,13em)}] {HCl Titration};
? 
>> node
! Isolated expression.
<to be read again> 
                   [
<to be read again> 
                   (false)
<to be read again> 
                   {
l.14 \node[shift={
                  (5em,13em)}] {HCl Titration};
? 
! Extra tokens will be flushed.
<to be read again> 
                   [
<to be read again> 
                   (false)
<to be read again> 
                   {
l.14 \node[shift={
                  (5em,13em)}] {HCl Titration};
? 
 )
